package com.levelup;

import com.levelup.ui.GUI;

/**
 * Created by Student-01 on 18.03.2016.
 */
public class Main {
    public static void main(String[] args) {
        new GUI().start();
    }
//    public void setDarkTheme(){
//
//    }
//    public void setLigthTheme(){
//
//    }
}


/*
1 Меню хелп в бар, ф вхелп -- эбаут
Эбаут--- окошко с контактными данными разработчика имейл и версия

2 Обработчики для меню и кнопок
 ньюгейм и выход (1 обработчик и для кнопки и для менюшки)

3 сделать вью сеттингс жменю - дарк и лайт (дефолт) с галочками (возмонжно тут понадобятся анонимные обработчики)
методы в классе, которые меняют цвет фона и текста

4 проверка победителя
если кто-то победил - выводим окно "х победил"
при нажатии ок в этом окне автоматически начинается нью гейм

 без анонимных обработчиков


 */